using System.Globalization;
using System.Text.RegularExpressions;
using MassTransit;
using Microsoft.Extensions.Logging;
using Pi.WalletService.Application.Services.OnboardService;
using Pi.WalletService.Application.Services.UserService;
using Pi.WalletService.Domain.AggregatesModel.DepositEntrypointAggregate;
using Pi.WalletService.Domain.AggregatesModel.WithdrawEntrypointAggregate;
using Pi.WalletService.Domain.Events.Deposit;
using Pi.WalletService.Domain.Exceptions;
namespace Pi.WalletService.Application.Commands.Deposit;

public record ValidatePaymentName(string CustomerCode, string PaymentAccountName);

public record ValidatePaymentNameV2(Guid CorrelationId);

public partial class ValidatePaymentNameConsumer :
    SagaConsumer,
    IConsumer<ValidatePaymentNameV2>,
    IConsumer<ValidatePaymentName>
{
    private readonly ILogger<ValidatePaymentNameConsumer> _logger;
    private readonly IOnboardService _onboardService;

    // Unable to put in ParameterStore as Character length exceed limit
    private readonly static List<string> ThTitle = new()
    {
        "น.ส.", "นางสาว", "นาง", "นาย", "ด.ญ.", "เด็กหญิง", "ด.ช.", "เด็กชาย", "พระสงฆ์", "บาทหลวง", "หม่อมหลวง", "หม่อมราชวงศ์", "หม่อมเจ้า", "ศาสตราจารย์เกียรติคุณ (กิตติคุณ)", "ศาสตราจารย์",
        "ผู้ช่วยศาสตราจารย์", "รองศาสตราจารย์",
        "พลเอก", "พลตรี", "พันโท", "ร้อยเอก", "ร้อยตรี", "จ่าสิบโท", "สิบเอก", "สิบตรี", "พล.อ.", "พล.ต.", "พ.ท.", "ร.อ.", "ว่าที่ ร.อ.", "ร.ต.", "ว่าที่ ร.ต.", "จ.ส.ท.", "ส.อ.", "ส.ต.", "พล.ท.", "พ.อ.", "พ.ต.", "ร.ท.", "ว่าที่ ร.ท.",
        "จ.ส.อ.", "จ.ส.ต.", "ส.ท.",
        "พลฯ", "พลโท", "พันเอก", "พันตรี", "ร้อยโท", "จ่าสิบเอก", "จ่าสิบตรี", "สิบโท", "พลทหาร", "พลเรือเอก", "พลเรือตรี", "นาวาโท", "เรือเอก", "เรือตรี", "พันจ่าโท", "จ่าเอก", "จ่าตรี",
        "พล.ร.อ.", "พล.ร.ต.", "น.ท. ...ร.น.",
        "ร.อ. ...ร.น.", "ร.ต. ...ร.น.", "ร.อ. หญิง", "พ.จ.ท.", "จ.อ.", "จ.ต.", "พล.ร.ท.", "น.อ. ...ร.น.", "น.ต. ...ร.น.", "ร.ท. ...ร.น.", "พ.จ.อ.", "พ.จ.ต.", "จ.ท.", "พลฯ", "พลเรือโท", "นาวาเอก", "นาวาตรี",
        "เรือโท",
        "พันจ่าเอก", "พันจ่าตรี", "จ่าโท", "พลทหาร", "พล.อ.อ.", "พล.อ.ต.", "น.ท.", "ร.อ.", "ร.ต.", "พ.อ.ท.", "จ.อ.", "จ.ต.", "พลอากาศเอก", "พลอากาศตรี", "นาวาอากาศโท", "เรืออากาศเอก",
        "เรืออากาศตรี", "พันจ่าอากาศโท",
        "จ่าอากาศเอก", "จ่าอากาศตรี", "พลอากาศโท", "นาวาอากาศเอก", "นาวาอากาศตรี", "เรืออากาศโท", "พันจ่าอากาศเอก", "พันจ่าอากาศตรี", "จ่าอากาศโท", "พลทหาร", "พล.อ.ท.", "น.อ.", "น.ต.", "ร.ท.",
        "พ.อ.อ.", "พ.อ.ต.", "จ.ท.",
        "พลฯ", "พล.ต.อ.", "พล.ต.ต.", "พ.ต.ท.", "ร.ต.อ.", "ร.ต.ต.", "จ.ส.ต.", "ส.ต.ท.", "พลฯ", "พลตำรวจเอก", "พลตำรวจตรี", "พันตำรวจโท", "ร้อยตำรวจเอก", "ร้อยตำรวจตรี", "จ่าสิบตำรวจ", "สิบตำรวจโท",
        "พลตำรวจ",
        "พล.ต.ท.", "พ.ต.อ.", "พ.ต.ต.", "ร.ต.ท.", "ด.ต.", "ส.ต.อ.", "ส.ต.ต.", "พลตำรวจโท", "พันตำรวจเอก", "พันตำรวจตรี", "ร้อยตำรวจโท", "นายดาบตำรวจ", "สิบตำรวจเอก", "สิบตำรวจตรี", "นาย", "นางสาว",
        "หม่อมหลวง",
        "สามเณร", "พระอธิการ", "พระปลัด", "พระใบฎีกา", "พระครูสมุห์", "พระมหา", "พระครูวินัยธร", "ม.ล.", "นาง", "บาทหลวง", "หม่อมราชวงศ์", "พระ", "เจ้าอธิการ", "พระสมุห์", "พระครูปลัด",
        "พระครูใบฎีกา", "พระครูธรรมธร", "ม.ร.ว.",
        "พระบาทสมเด็จพระเจ้าอยู่หัว", "สมเด็จพระนางเจ้า", "สมเด็จพระศรีนครินทราบรมราชชนนี", "พลโทสมเด็จพระบรมโอรสาธิราช", "พลตรีสมเด็จพระเทพรัตนราชสุดา", "พระเจ้าวรวงศ์เธอพระองค์หญิง",
        "พระเจ้าวรวงศ์เธอ พระองค์เจ้า",
        "สมเด็จพระเจ้าพี่นางเธอเจ้าฟ้า", "สมเด็จพระ", "สมเด็จพระเจ้าลูกเธอ", "สมเด็จพระเจ้าลูกยาเธอ", "สมเด็จเจ้าฟ้า", "พระเจ้าบรมวงศ์เธอ", "พระเจ้าวรวงศ์เธอ", "พระเจ้าหลานเธอ",
        "พระเจ้าหลานยาเธอ", "พระวรวงศ์เธอ",
        "สมเด็จพระเจ้าภคินีเธอ", "พระองค์เจ้า", "หม่อมเจ้า", "หม่อมราชวงศ์", "หม่อมหลวง", "พระยา", "หลวง", "ขุน", "หมื่น", "เจ้าคุณ", "พระวรวงศ์เธอพระองค์เจ้า", "คุณ", "คุณหญิง",
        "ท่านผู้หญิงหม่อมหลวง", "ศาสตราจารย์นายแพทย์",
        "แพทย์หญิงคุณหญิง", "นายแพทย์", "แพทย์หญิง", "ทัณตแพทย์", "ทัณตแพทย์หญิง", "สัตวแพทย์", "สัตวแพทย์หญิง", "ดอกเตอร์", "ผู้ช่วยศาสตราจารย์", "รองศาสตราจารย์", "ศาสตราจารย์", "เภสัชกรชาย",
        "เภสัชกรหญิง", "หม่อม", "รองอำมาตย์เอก",
        "ท้าว", "เจ้า", "ท่านผู้หญิง", "คุณพระ", "ศาสตราจารย์คุณหญิง", "ซิสเตอร์", "เจ้าชาย", "เจ้าหญิง", "รองเสวกตรี", "เสด็จเจ้า", "เอกอัครราชฑูต", "พลสารวัตร", "สมเด็จเจ้า", "เจ้าฟ้า",
        "รองอำมาตย์ตรี", "หม่อมเจ้าหญิง", "ทูลกระหม่อม",
        "ศาสตราจารย์ดอกเตอร์", "เจ้านาง", "จ่าสำรอง", "พลเอก", "ว่าที่พลเอก", "พลโท", "พลตรี", "ว่าที่พลตรี", "พันเอกพิเศษ", "ว่าที่พันเอกพิเศษ", "พันเอก", "ว่าที่พันเอก", "พันโท", "ว่าที่พันโท",
        "พันตรี", "ว่าที่พันตรี", "ร้อยเอก", "ว่าที่ร้อยเอก",
        "ร้อยโท", "ว่าที่ร้อยโท", "ร้อยตรี", "ว่าที่ร้อยตรี", "จ่าสิบเอก", "จ่าสิบโท", "จ่าสิบตรี", "สิบเอก", "สิบโท", "สิบตรี", "พลทหาร", "นักเรียนนายร้อย", "นักเรียนนายสิบ", "พลจัตวา",
        "พลฯ อาสาสมัคร", "ร้อยเอกหม่อมเจ้า", "พลโทหม่อมเจ้า",
        "ร้อยตรีหม่อมเจ้า", "ร้อยโทหม่อมเจ้า", "พันโทหม่อมเจ้า", "พันเอกหม่อมเจ้า", "พันตรีหม่อมราชวงศ์", "พันโทหม่อมราชวงศ์", "สิบตรีหม่อมราชวงศ์", "พันเอกหม่อมราชวงศ์", "จ่าสิบเอกหม่อมราชวงศ์",
        "ร้อยเอกหม่อมราชวงศ์", "ร้อยตรีหม่อมราชวงศ์",
        "สิบเอกหม่อมราชวงศ์", "ร้อยโทหม่อมราชวงศ์", "พันเอก(พิเศษ)หม่อมราชวงศ์", "พลฯหม่อมหลวง", "ร้อยเอกหม่อมหลวง", "สิบโทหม่อมหลวง", "พลโทหม่อมหลวง", "ร้อยโทหม่อมหลวง", "ร้อยตรีหม่อมหลวง",
        "สิบเอกหม่อมหลวง", "พลตรีหม่อมหลวง",
        "พันตรีหม่อมหลวง", "พันเอกหม่อมหลวง", "พันโทหม่อมหลวง", "จ่าสิบตรีหม่อมหลวง", "นักเรียนนายร้อยหม่อมหลวง", "ว่าที่ร้อยตรีหม่อมหลวง", "จ่าสิบเอกหม่อมหลวง", "ร้อยเอกนายแพทย์",
        "ร้อยเอกแพทย์หญิง", "ร้อยโทนายแพทย์", "พันตรีนายแพทย์",
        "ว่าที่ร้อยโทนายแพทย์", "พันเอกนายแพทย์", "ร้อยตรีนายแพทย์", "ร้อยโทแพทย์หญิง", "พลตรีนายแพทย์", "พันโทนายแพทย์", "จอมพล", "พันโทหลวง", "พันตรีพระเจ้าวรวงศ์เธอพระองค์เจ้า",
        "ศาสตราจารย์พันเอก", "พันตรีหลวง", "พลโทหลวง",
        "ร้อยโทดอกเตอร์", "ร้อยเอกดอกเตอร์", "สารวัตรทหาร", "ร้อยตรีดอกเตอร์", "พันตรีคุณหญิง", "จ่าสิบตรีหม่อมราชวงศ์", "พลจัตวาหลวง", "พลตรีหม่อมราชวงศ์", "พันตรีพระเจ้าวรวงศ์เธอพระองค์",
        "ท่านผู้หญิงหม่อมราชวงศ์", "ศาสตราจารย์ร้อยเอก",
        "พันโทคุณหญิง", "ร้อยตรีแพทย์หญิง", "พลเอกหม่อมหลวง", "ว่าที่ร้อยตรีหม่อมราชวงศ์", "พันเอกหญิงคุณหญิง", "จ่าสิบเอกพิเศษ", "พลเรือเอก", "ว่าที่พลเรือเอก", "พลเรือโท", "ว่าที่พลเรือโท",
        "พลเรือตรี", "ว่าที่พลเรือตรี", "นาวาเอกพิเศษ",
        "ว่าที่นาวาเอกพิเศษ", "นาวาเอก", "ว่าที่นาวาเอก", "นาวาโท", "ว่าที่นาวาโท", "นาวาตรี", "ว่าที่นาวาตรี", "เรือเอก", "ว่าที่เรือเอก", "เรือโท", "ว่าที่เรือโท", "เรือตรี", "ว่าที่เรือตรี",
        "พันจ่าเอก", "พันจ่าโท", "พันจ่าตรี",
        "จ่าเอก", "จ่าโท", "จ่าตรี", "พลฯทหารเรือ", "นักเรียนนายเรือ", "นักเรียนจ่าทหารเรือ", "พลเรือจัตวา", "นาวาโทหม่อมเจ้า", "นาวาเอกหม่อมเจ้า", "นาวาตรีหม่อมเจ้า", "พลเรือตรีหม่อมราชวงศ์",
        "นาวาเอกหม่อมราชวงศ์",
        "นาวาโทหม่อมราชวงศ์", "นาวาตรีหม่อมราชวงศ์", "นาวาโทหม่อมหลวง", "นาวาตรีหม่อมหลวง", "พันจ่าเอกหม่อมหลวง", "นาวาตรีแพทย์หญิง", "นาวาอากาศเอกหลวง", "พลเรือตรีหม่อมเจ้า", "นาวาตรีนายแพทย์",
        "พลเรือตรีหม่อมหลวง",
        "พลอากาศเอก", "ว่าที่พลอากาศเอก", "พลอากาศโท", "ว่าที่พลอากาศโท", "พลอากาศตรี", "ว่าที่พลอากาศตรี", "นาวาอากาศเอกพิเศษ", "ว่าที่นาวาอากาศเอกพิเศษ", "นาวาอากาศเอก", "ว่าที่นาวาอากาศเอก",
        "นาวาอากาศโท",
        "ว่าที่นาวาอากาศโท", "นาวาอากาศตรี", "ว่าที่นาวาอากาศตรี", "เรืออากาศเอก", "ว่าที่เรืออากาศเอก", "เรืออากาศโท", "ว่าที่เรืออากาศโท", "เรืออากาศตรี", "ว่าที่เรืออากาศตรี", "พันจ่าอากาศเอก",
        "พันจ่าอากาศโท", "พันจ่าอากาศตรี",
        "จ่าอากาศเอก", "จ่าอากาศโท", "จ่าอากาศตรี", "พลฯทหารอากาศ", "นักเรียนนายเรืออากาศ", "นักเรียนจ่าอากาศ", "นักเรียนพยาบาลทหารอากาศ", "พันอากาศเอกหม่อมราชวงศ์", "พลอากาศตรีหม่อมราชวงศ์",
        "พลอากาศโทหม่อมหลวง",
        "เรืออากาศโทขุน", "พันจ่าอากาศเอกหม่อมหลวง", "เรืออากาศเอกนายแพทย์", "พลอากาศเอกหม่อมราชวงศ์", "พลอากาศตรีหม่อมหลวง", "พลอากาศจัตวา", "พลอากาศโทหม่อมราชวงศ์", "นาวาอากาศเอกหม่อมหลวง",
        "พระครูพิบูลสมณธรรม",
        "พลตำรวจเอก", "ว่าที่พลตำรวจเอก", "พลตำรวจโท", "ว่าที่พลตำรวจโท", "พลตำรวจตรี", "ว่าที่พลตำรวจตรี", "พลตำรวจจัตวา", "ว่าที่พลตำรวจจัตวา", "พันตำรวจเอก (พิเศษ)", "ว่าที่พันตำรวจเอก(พิเศษ)",
        "พันตำรวจเอก", "ว่าที่พันตำรวจเอก",
        "พันตำรวจโท", "ว่าที่พันตำรวจโท", "พันตำรวจตรี", "ว่าที่พันตำรวจตรี", "ร้อยตำรวจเอก", "ว่าที่ร้อยตำรวจเอก", "ร้อยตำรวจโท", "ว่าที่ร้อยตำรวจโท", "ร้อยตำรวจตรี", "ว่าที่ร้อยตำรวจตรี",
        "นายดาบตำรวจ", "จ่าสิบตำรวจ", "สิบตำรวจเอก",
        "สิบตำรวจโท", "สิบตำรวจตรี", "นักเรียนนายร้อยตำรวจ", "นักเรียนนายสิบตำรวจ", "นักเรียนพลตำรวจ", "พลตำรวจ", "พลตำรวจพิเศษ", "พลตำรวจอาสาสมัคร", "พลตำรวจสำรอง", "พลตำรวจสำรองพิเศษ",
        "พลตำรวจสมัคร",
        "สมาชิกอาสารักษาดินแดน", "นายกองใหญ่", "นายกองเอก", "นายกองโท", "นายกองตรี", "นายหมวดเอก", "นายหมวดโท", "นายหมวดตรี", "นายหมู่ใหญ่", "นายหมู่เอก", "นายหมู่โท", "นายหมู่ตรี", "สมาชิกเอก",
        "สมาชิกโท", "สมาชิกตรี",
        "อาสาสมัครทหารพราน", "พันตำรวจโทหม่อมเจ้า", "พันตำรวจเอกหม่อมเจ้า", "นักเรียนนายร้อยตำรวจหม่อมเจ้า", "พลตำรวจตรีหม่อมราชวงศ์", "พันตำรวจตรีหม่อมราชวงศ์", "พันตำรวจโทหม่อมราชวงศ์",
        "พันตำรวจเอกหม่อมราชวงศ์",
        "ร้อยตำรวจเอกหม่อมราชวงศ์", "สิบตำรวจเอกหม่อมหลวง", "พันตำรวจเอกหม่อมหลวง", "พันตำรวจโทหม่อมหลวง", "นักเรียนนายร้อยตำรวจหม่อมหลวง", "ร้อยตำรวจโทหม่อมหลวง", "นายดาบตำรวจหม่อมหลวง",
        "พันตำรวจตรีหม่อมหลวง",
        "ศาสตราจารย์นายแพทย์พันตำรวจเอก", "พันตำรวจโทนายแพทย์", "ร้อยตำรวจโทนายแพทย์", "ร้อยตำรวจเอกนายแพทย์", "พันตำรวจตรีนายแพทย์", "พันตำรวจเอกนายแพทย์", "พันตำรวจตรีหลวง",
        "ร้อยตำรวจโทดอกเตอร์", "พันตำรวจเอกดอกเตอร์",
        "ร้อยตำรวจเอกหม่อมหลวง", "พันตำรวจเอกหญิง ท่านผู้หญิง", "พลตำรวจตรีหม่อมหลวง", "พลตรีหญิง คุณหญิง", "ว่าที่สิบเอก", "พลตำรวจเอกดอกเตอร์", "สมเด็จพระสังฆราชเจ้า", "สมเด็จพระสังฆราช",
        "สมเด็จพระราชาคณะ",
        "รองสมเด็จพระราชาคณะ", "พระราชาคณะ", "พระเปรียญธรรม", "พระหิรัญยบัฏ", "พระสัญญาบัตร", "พระราช", "พระเทพ", "พระปลัดขวา", "พระปลัดซ้าย", "พระครูปลัด", "พระครูปลัดสุวัฒนญาณคุณ",
        "พระครูปลัดอาจารย์วัฒน์", "พระครูวิมลสิริวัฒน์",
        "พระสมุห์", "พระครูสมุห์", "พระครู", "พระครูใบฎีกา", "พระครูธรรมธร", "พระครูวิมลภาณ", "พระครูศัพทมงคล", "พระครูสังฆภารวิชัย", "พระครูสังฆรักษ์", "พระครูสังฆวิชัย", "พระครูสังฆวิชิต",
        "พระปิฎก", "พระปริยัติ", "เจ้าอธิการ", "พระอธิการ",
        "พระ", "สามเณร", "พระปลัด", "สมเด็จพระอริยวงศาคตญาณ", "พระคาร์ดินัล", "พระสังฆราช", "พระคุณเจ้า", "บาทหลวง", "พระมหา", "พระราชปัญญา", "ภาราดา", "พระศรีปริยัติธาดา", "พระญาณโศภณ",
        "สมเด็จพระมหาวีรวงศ์",
        "พระโสภณธรรมาภรณ์", "พระวิริวัฒน์วิสุทธิ์", "พระญาณ", "พระอัครสังฆราช", "พระธรรม", "พระสาสนโสภณ", "พระธรรมโสภณ", "พระอุดมสารโสภณ", "พระครูวิมลญาณโสภณ", "พระครูปัญญาภรณโสภณ",
        "พระครูโสภณปริยัติคุณ", "พระอธิธรรม",
        "พระราชญาณ", "พระสุธีวัชโรดม", "รองเจ้าอธิการ", "พระครูวินัยธร", "พระศรีวชิราภรณ์", "พระราชบัณฑิต", "แม่ชี", "นักบวช", "พระรัตน", "พระโสภณปริยัติธรรม", "พระครูวิศาลปัญญาคุณ",
        "พระศรีปริยัติโมลี", "พระครูวัชรสีลาภรณ์",
        "พระครูพิพัฒน์บรรณกิจ", "พระครูวิบูลธรรมกิจ", "พระครูพัฒนสารคุณ", "พระครูสุวรรณพัฒนคุณ", "พระครูพรหมวีรสุนทร", "พระครูอุปถัมภ์นันทกิจ", "พระครูวิจารณ์สังฆกิจ", "พระครูวิมลสารวิสุทธิ์",
        "พระครูไพศาลศุภกิจ", "พระครูโอภาสธรรมพิมล",
        "พระครูพิพิธวรคุณ", "พระครูสุนทรปภากร", "พระครูสิริชัยสถิต", "พระครูเกษมธรรมานันท์", "พระครูถาวรสันติคุณ", "พระครูวิสุทธาจารวิมล", "พระครูปภัสสราธิคุณ", "พระครูวรสังฆกิจ",
        "พระครูไพบูลชัยสิทธิ์", "พระครูโกวิทธรรมโสภณ",
        "พระครูสุพจน์วราภรณ์", "พระครูไพโรจน์อริญชัย", "พระครูสุนทรคณาภิรักษ์", "พระสรภาณโกศล", "พระครูประโชติธรรมรัตน์", "พระครูจารุธรรมกิตติ์", "พระครูพิทักษ์พรหมรังษี", "พระศรีปริยัติบัณฑิต",
        "พระครูพุทธิธรรมานุศาสน์", "พระธรรมเมธาจารย์",
        "พระครูกิตติกาญจนวงศ์", "พระครูปลัดสัมพิพัฒนวิริยาจารย์", "พระครูศีลกันตาภรณ์", "พระครูประกาศพุทธพากย์", "พระครูอมรวิสุทธิคุณ", "พระครูสุทัศน์ธรรมาภิรม", "พระครูอุปถัมภ์วชิโรภาส",
        "พระครูสุนทรสมณคุณ", "พระพรหมมุนี", "พระครูสิริคุณารักษ์",
        "พระครูวิชิตพัฒนคุณ", "พระครูพิบูลโชติธรรม", "พระพิศาลสารคุณ", "พระรัตนมงคลวิสุทธ์", "พระครูโสภณคุณานุกูล", "พระครูผาสุกวิหารการ", "พระครูวชิรวุฒิกร", "พระครูกาญจนยติกิจ",
        "พระครูบวรรัตนวงศ์", "พระราชพัชราภรณ์", "พระครูพิพิธอุดมคุณ",
        "องสุตบทบวร", "พระครูจันทเขมคุณ", "พระครูศีลสารวิสุทธิ์", "พระครูสุธรรมโสภิต", "พระครูอุเทศธรรมนิวิฐ", "พระครูบรรณวัตร", "พระครูวิสุทธาจาร", "พระครูสุนทรวรวัฒน์",
        "พระเทพชลธารมุนี ศรีชลบุราจารย์", "พระครูโสภณสมุทรคุณ",
        "พระราชเมธาภรณ์", "พระครูศรัทธาธรรมโสภณ", "พระครูสังฆบริรักษ์", "พระมหานายก", "พระครูโอภาสสมาจาร", "พระครูศรีธวัชคุณาภรณ์", "พระครูโสภิตวัชรกิจ", "พระราชวชิราภรณ์", "พระครูสุนทรวรธัช",
        "พระครูอาทรโพธิกิจ", "พระครูวิบูลกาญจนกิจ",
        "พระพรหมวชิรญาณ", "พระครูสุพจน์วรคุณ", "พระราชาวิมลโมลี", "พระครูอมรธรรมนายก", "พระครูพิศิษฎ์ศาสนการ", "พระครูเมธีธรรมานุยุต", "พระครูปิยสีลสาร", "พระครูสถิตบุญวัฒน์",
        "พระครูนิเทศปิยธรรม", "พระครูวิสุทธิ์กิจจานุกูล",
        "พระครูสถิตย์บุญวัฒน์", "พระครูประโชติธรรมานุกูล", "พระเทพญาณกวี", "พระครูพิพัฒน์ชินวงศ์", "พระครูสมุทรขันตยาภรณ์", "พระครูภาวนาวรกิจ", "พระครูศรีศาสนคุณ", "พระครูวิบูลย์ธรรมศาสก์",
        "เด็กชาย", "เด็กหญิง", "นาย", "นางสาว", "นาง",
        "นักโทษชายหม่อมหลวง", "นักโทษชาย", "นักโทษหญิง", "นักโทษชายจ่าสิบเอก", "นักโทษชายจ่าเอก", "นักโทษชายพลทหาร", "นักโทษชายร้อยตรี", "ดาบตำรวจ", "นักสิบพลตำรวจ", "เรือเอกหญิง", "นาวาเอกหญิง",
        "เรือโทหญิง", "เรือตรีหญิง",
        "พระเจ้าหลานเธอ พระองค์เจ้า", "สมเด็จพระราชชนนี", "ว่าที่ร้อยโทหญิง", "ว่าที่ร้อยเอกหญิง", "ว่าที่พันตรีหญิง", "ว่าที่พันโทหญิง", "ว่าที่พันเอกหญิง", "สิบตรีหญิง", "สิบตำรวจตรีหญิง",
        "สิบตำรวจโทหญิง", "สิบตำรวจเอกหญิง", "สิบโทหญิง",
        "สิบเอกหญิง", "บริษัท", "ผู้ช่วยศาสตราจารย์", "ห้างหุ้นส่วนจำกัด", "ห้างหุ้นส่วนสามัญนิติบุคคล", "จ่า", "หม่อมราชวงศ์หญิง", "พลจัตวา", "มูลนิธิ", "พันเอกขุน", "พลตำรวจตรีหลวง",
        "พลอากาศตรีหลวง", "พลเอกหลวง", "พลจัตวาหม่อม",
        "พลเรือเอกหม่อมเจ้า", "พลเรือเอกหลวง", "พลตำรวจเอกหลวง", "พลตรีหลวง", "พลเรือโทหลวง", "พลเรือตรีพระ", "พลเอกพระ", "นาวาโทพระ", "พลเรือตรีหลวง", "นาวาอากาศตรีหลวง", "พันโทพระ",
        "จอมพลเรือหลวง", "พันตำรวจโทขุน",
        "พลโทพระยา", "พลตรีหม่อม", "พันเอกพระยา", "เรืออากาศเอกหลวง", "พลตำรวจโทหลวง", "พันตำรวจเอกหลวง", "พลเอกเจ้าพระยา", "บริษัท", "จ่าสิบตำรวจหญิง", "รองศาสตราจารย์ดอกเตอร์", "กลุ่ม",
        "ผู้ช่วยศาสตราจารย์ดอกเตอร์",
        "พลตำรวจโทหม่อมหลวง", "พลตำรวจโทหม่อมราชวงศ์", "ทูลกระหม่อมหญิง", "สมเด็จ", "ดาตุก์", "พระบาทสมเด็จ", "เชค", "เชคะ"
    };

    private readonly static List<string> EnTitle = new()
    {
        "Miss", "Mrs.", "Mr.", "Miss", "Master", "Buddhist Monk", "Rev.", "Mom Luang (M.L.)", "Mom Rajawong (M.R.)", "Mom Chao (M.C.)", "Emeritus Professor", "Professor", "Assistant Professor",
        "Associate Professor", "GEN", "MAJ GEN", "LT COL", "CAPT", "ACT CAPT", "SUB LT", "ACT SUB LT", "S M 2", "SGT", "PFC", "GEN", "MAJ GEN", "LT COL", "CAPT", "SUB LT", "S M 2", "SGT", "PFC", "LT GEN", "COL", "MAJ",
        "LT", "ACT LT", "S M 1", "S M 3", "CPL", "PVT", "LT GEN", "COL", "MAJ", "LT", "S M 1", "S M 3", "CPL", "PVT", "ADM", "R ADM", "CDR", "LT", "SUB LT", "CPO 2", "PO 1", "PO 3", "ADM", "R ADM", "CDR",
        "LT", "SUB LT", "CPO 2", "PO 1", "PO 3", "V ADM", "CAPT", "L CDR", "LT JG", "CPO 1", "CPO 3", "PO 2", "SEA-MAN", "V ADM", "CAPT", "L CDR", "LT JG", "CPO 1", "CPO 3", "PO 2", "SEA-MAN",
        "ACM", "AVM", "WG CDR", "FLT LT", "PLT OFF", "FS 2", "SGT", "LAC", "ACM", "AVM", "WG CDR", "FLT LT", "PLT OFF", "FS 2", "SGT", "LAC", "AM", "GP CAPT", "SQN LDR", "FLG OFF", "FS 1", "FS 3",
        "CPL", "AMN", "AM", "GP CAPT", "SQN LDR", "FLG OFF", "FS 1", "FS 3", "CPL", "AMN", "POL GEN", "POL MAJ GEN", "POL LT COL", "POL CAPT", "POL SUB LT", "POL SGT MAJ", "POL CPL", "POL CONST",
        "POL GEN", "POL MAJ GEN", "POL LT COL", "POL CAPT", "POL SUB LT", "POL SGT MAJ", "POL CPL", "POL CONST", "POL LT GEN", "POL COL", "POL MAJ", "POL LT", "POL SEN SGT MAJ", "POL SGT",
        "POL L/C", "POL LT GEN", "POL COL", "POL MAJ", "POL LT", "POL SEN SGT MAJ", "POL SGT", "POL L/C", "MR", "MISS", "M L", "SAMANERA", "PHRA ATHIKAN", "PHRAPALAD", "PHRABAIDIKA",
        "PHRAKHU SAMU", "PHRAMAHA", "PHRAKHU VINAIDHORN", "M L", "MRS", "REV", "M R", "PHRA", "CHAO ATHIKAN", "PHRASAMU", "PHRAKHU PALAD", "PHRAKHU BAIDIKA", "PHRAKHU DHAMMADHORN", "M R", "MS",
        "MS."
    };

    public ValidatePaymentNameConsumer(
        ILogger<ValidatePaymentNameConsumer> logger,
        IDepositEntrypointRepository depositEntrypointRepository,
        IWithdrawEntrypointRepository withdrawEntrypointRepository,
        IOnboardService onboardService) : base(depositEntrypointRepository, withdrawEntrypointRepository)
    {
        _onboardService = onboardService;
        _logger = logger;
    }

    public async Task Consume(ConsumeContext<ValidatePaymentName> context)
    {
        var result = await ValidateName(context.Message.PaymentAccountName, context.Message.CustomerCode);
        if (result == null)
        {
            throw new Exception("Validate name failed");
        }

        await context.RespondAsync(result);
    }

    public async Task Consume(ConsumeContext<ValidatePaymentNameV2> context)
    {
        var depositEntrypoint = await GetDepositEntrypointByIdAsync(context.Message.CorrelationId);
        if (depositEntrypoint == null)
        {
            throw new Exception("Deposit Entrypoint Not Found");
        }

        _logger.LogInformation("validate payment name with entrypoint: {@depositEntrypoint}", depositEntrypoint);
        var result = await ValidateName(depositEntrypoint.BankAccountName!, depositEntrypoint.CustomerCode);
        if (result == null)
        {
            throw new Exception("Validate Name Failed");
        }

        await context.RespondAsync(result);
    }

    private async Task<DepositValidatePaymentNameSucceed?> ValidateName(string accountName, string customerCode)
    {
        var user = await _onboardService.GetCustomerInfo(customerCode);

        _logger.LogInformation("validate payment name user info: {@user}", user);

        var enName = $"{user.FirstnameEn} {user.LastnameEn}";
        var enSwappedName = $"{user.LastnameEn} {user.FirstnameEn}";
        var thName = $"{user.FirstnameTh} {user.LastnameTh}";
        var thSwappedName = $"{user.LastnameTh} {user.FirstnameTh}";

        var isEnglish = EnglishRegex().IsMatch(accountName.Replace(" ", string.Empty));
        var title = isEnglish ? EnTitle : ThTitle;

        var paymentAccountName = ReplaceSpecialCharacterAndToLower(accountName);
        var storedName = ReplaceSpecialCharacterAndToLower(isEnglish ? enName : thName);
        var storedSwappedName = ReplaceSpecialCharacterAndToLower(isEnglish ? enSwappedName : thSwappedName);

        var isNameMismatch = !CompareNameByIgnoringSpecialCharacters(paymentAccountName, storedName, title)
                          && !CompareNameByIgnoringSpecialCharacters(paymentAccountName, storedSwappedName, title);

        if (isNameMismatch)
        {
            throw new CustomerNameAndBankAccountNameMismatchException("Customer Name and Bank Account Name Mismatch");
        }

        return new DepositValidatePaymentNameSucceed(thName, enName);
    }

    private bool CompareNameByIgnoringSpecialCharacters(string paymentAccountName, string name, List<string> title)
    {
        if (paymentAccountName.Equals(name, StringComparison.CurrentCultureIgnoreCase))
        {
            return true;
        }

        var shorterText = paymentAccountName.Length > name.Length ? name : paymentAccountName;
        var longerText = paymentAccountName.Length > name.Length ? paymentAccountName : name;
        if (longerText.Contains(shorterText))
        {
            var extraText = longerText.Replace(shorterText, "");
            if (title.Exists(t => ReplaceSpecialCharacterAndToLower(t).Equals(extraText, StringComparison.CurrentCultureIgnoreCase)))
            {
                return true;
            }
        }

        return false;
    }

    private string ReplaceSpecialCharacterAndToLower(string input)
    {
        return AllowedSpecialCharacterRegex().Replace(input, "").ToLower(CultureInfo.CurrentCulture);
    }

    [GeneratedRegex("^[a-zA-Z0-9\\.\\-]*$")]
    private partial Regex EnglishRegex();

    [GeneratedRegex(@"[\.\s-]+")]
    private partial Regex AllowedSpecialCharacterRegex();

}
